#!/usr/bin/python3
# -*- coding: utf-8 -*-
#
# Copyright (c) 2011, dimitriadis dimitris
# All rights reserved.
#
# Redistribution and use in source and binary forms, with or without
# modification, are permitted provided that the following conditions are met:
#    * Redistributions of source code must retain the above copyright
#      notice, this list of conditions and the following disclaimer.
#    * Redistributions in binary form must reproduce the above copyright
#      notice, this list of conditions and the following disclaimer in the
#      documentation and/or other materials provided with the distribution.
#    * Neither the name of the dimitriadis dimitris nor the
#      names of its contributors may be used to endorse or promote products
#      derived from this software without specific prior written permission.
#
# THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
# ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
# WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
# DISCLAIMED. IN NO EVENT SHALL dimitriadis dimitris BE LIABLE FOR ANY
# DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
# (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
# LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
# ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
# (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
# SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

τύπωσε = print
κείμενο = str
λίστα = list
μήκος = len
εύρος = range
ακέραιος = int
τίποτα = None
ναι = True
όχι = False

class Δοκιμές_Επιρρημάτων():
	def __init__(self, γραμματική):
		self.αναγνώριση = γραμματική.αναγνώριση
		self.δεδομένα_αναγνώρισης = []

	def δοκιμές_αναγνώρισης(self):
		δεδομένα_αναγνώρισης_γενικά = [
			["ἄνω",      "τοπικό",     None, "κοινή"],	["κάτω",     "τοπικό",     None, "κοινή"],
			["ἐγγύς",    "τοπικό",     None, "κοινή"],	["ἔσω",      "τοπικό",     None, "κοινή"],
			["ἔξω",      "τοπικό",     None, "κοινή"],	["νῦν",      "χρονικό",    None, "κοινή"],
			["πρὶν",     "χρονικό",    None, "κοινή"],	["ἔπειτα",   "χρονικό",    None, "κοινή"],
			["πάλαι",    "χρονικό",    None, "κοινή"],	["χθές",     "χρονικό",    None, "κοινή"],
			["σήμερον",  "χρονικό",    None, "κοινή"],	["αὔριον",   "χρονικό",    None, "κοινή"],
			["αὖ",       "χρονικό",    None, "κοινή"],	["αὖθις",    "χρονικό",    None, "κοινή"],
			["εὖ",       "τροπικό",    None, "κοινή"],	["καλῶς",    "τροπικό",    None, "κοινή"],
			["κακῶς",    "τροπικό",    None, "κοινή"],	["σωφρόνως", "τροπικό",    None, "κοινή"],
			["ὅσον",     "ποσοτικό",   None, "κοινή"],	["πολύ",     "ποσοτικό",   None, "κοινή"],
			["μάλα",     "ποσοτικό",   None, "κοινή"],	["ἄγαν",     "ποσοτικό",   None, "κοινή"],
			["λίαν",     "ποσοτικό",   None, "κοινή"],	["πάνυ",     "ποσοτικό",   None, "κοινή"],
			["σφόδρα",   "ποσοτικό",   None, "κοινή"],	["ὀλίγον",   "ποσοτικό",   None, "κοινή"],
			["ποσάκις",  "ποσοτικό",   None, "κοινή"],	["τοσάκις",  "ποσοτικό",   None, "κοινή"],
			["πολλάκις", "ποσοτικό",   None, "κοινή"],	["δίς",      "ποσοτικό",   None, "κοινή"],
			["τρίς",     "ποσοτικό",   None, "κοινή"],	["τετράκις", "ποσοτικό",   None, "κοινή"],
			["ναί",      "βεβαιωτικό", None, "κοινή"],	["μάλιστα",  "βεβαιωτικό", None, "κοινή"],
			["δὴ",       "βεβαιωτικό", None, "κοινή"],	["δῆτα",     "βεβαιωτικό", None, "κοινή"],
			["ἦ",        "βεβαιωτικό", None, "κοινή"],	["οὐ",       "αρνητικό",   None, "κοινή"],
			["μή",       "αρνητικό",   None, "κοινή"],	["ἆρα",      "διστακτικό", None, "κοινή"],
			["μῶν",      "διστακτικό", None, "κοινή"],	["τάχα",     "διστακτικό", None, "κοινή"],
			["ἴσως",     "διστακτικό", None, "κοινή"],

			["ἐπάνω",    "τοπικό", None, "δημοτική"], ["πάνω",     "τοπικό", None, "δημοτική"],
			["κάτω",     "τοπικό", None, "δημοτική"],	["ψηλὰ",     "τοπικό", None, "δημοτική"],
			["μέσα",     "τοπικό", None, "δημοτική"],	["καταγῆς",  "τοπικό", None, "δημοτική"],
			["ἐμπρὸς",   "τοπικό", None, "δημοτική"],	["έξω",      "τοπικό", None, "δημοτική"],
			["δεξιὰ",    "τοπικό", None, "δημοτική"],	["μπρὸς",    "τοπικό", None, "δημοτική"],
			["ἀριστερὰ", "τοπικό", None, "δημοτική"],	["πίσω",     "τοπικό", None, "δημοτική"],
			["χαμηλὰ",   "τοπικό", None, "δημοτική"],	["κοντά",    "τοπικό", None, "δημοτική"],
			["πλάι",     "τοπικό", None, "δημοτική"],	["δίπλα",    "τοπικό", None, "δημοτική"],
			["μακριά",   "τοπικό", None, "δημοτική"],	["ἀπέναντι", "τοπικό", None, "δημοτική"],
			["γύρω",     "τοπικό", None, "δημοτική"],	["ολόγυρα",  "τοπικό", None, "δημοτική"],
			["μεταξὺ",   "τοπικό", None, "δημοτική"],	["ἀνάμεσα",  "τοπικό", None, "δημοτική"],
			["πέρα",     "τοπικό", None, "δημοτική"],	["ἀναμεταξὺ","τοπικό", None, "δημοτική"],
			["βόρεια",   "τοπικό", None, "δημοτική"],	["ἀντίπερα", "τοπικό", None, "δημοτική"],
			["ανατολικὰ","τοπικό", None, "δημοτική"],	["νότια",    "τοπικό", None, "δημοτική"],
			["δυτικὰ",   "τοπικό", None, "δημοτική"],	["βορειοανατολικὰ", "τοπικό", None, "δημοτική"],
			["βορειοδυτικὰ","τοπικό",None,"δημοτική"],["νοτιοανατολικὰ",  "τοπικό", None, "δημοτική"],
			["νοτιοδυτικὰ","τοπικό",None,"δημοτική"],
			["ἀμέσως",   "χρονικό", None, "δημοτική"],	["εὐθὺς",  "χρονικό", None, "δημοτική"],
			["κιόλας",   "χρονικό", None, "δημοτική"],	["ἤδη",    "χρονικό", None, "δημοτική"],
			["πιὰ",      "χρονικό", None, "δημοτική"],	["μόλις",  "χρονικό", None, "δημοτική"],
			["ἀκόμη",    "χρονικό", None, "δημοτική"],	["ἀκόμα",  "χρονικό", None, "δημοτική"],
			["πάλι",     "χρονικό", None, "δημοτική"],	["ξανὰ",   "χρονικό", None, "δημοτική"],
			["κατόπιν",  "χρονικό", None, "δημοτική"],	["συχνὰ",  "χρονικό", None, "δημοτική"],
			["πρῶτα",    "χρονικό", None, "δημοτική"],	["συνήθως","χρονικό", None, "δημοτική"],
			["πρὶν",     "χρονικό", None, "δημοτική"],	["ὕστερα", "χρονικό", None, "δημοτική"],
			["πρωτύτερα","χρονικό", None, "δημοτική"],	["ἔπειτα", "χρονικό", None, "δημοτική"],
			["ἀργὰ",     "χρονικό", None, "δημοτική"],	["νωρὶς",  "χρονικό", None, "δημοτική"],
			["συνάμα",   "χρονικό", None, "δημοτική"],	["γρήγορα",  "χρονικό", None, "δημοτική"],
			["ἔγκαιρα",  "χρονικό", None, "δημοτική"],	["ἀδιάκοπα", "χρονικό", None, "δημοτική"],
			["προχτὲς",  "χρονικό", None, "δημοτική"],	["χτὲς",     "χρονικό", None, "δημοτική"],
			["σήμερα",   "χρονικό", None, "δημοτική"],	["ἐψὲς",     "χρονικό", None, "δημοτική"],
			["ψὲς",      "χρονικό", None, "δημοτική"],	["ἀπόψε",    "χρονικό", None, "δημοτική"],
			["αὔριο",    "χρονικό", None, "δημοτική"],	["μεθαύριο", "χρονικό", None, "δημοτική"],
			["πέρσι",    "χρονικό", None, "δημοτική"],	["πέρυσι",   "χρονικό", None, "δημοτική"],
			["φέτος",    "χρονικό", None, "δημοτική"],	["πρόπερσι", "χρονικό", None, "δημοτική"],
			# ["τοῦ χρόνου","χρονικό",None, "δημοτική"],
			# ["τοῦ κάκου",  "τροπικό", None, "δημοτική"],
			# ["ὄχι βέβαια", "διστακτικό", None, "δημοτική"],
			# ["πάνω κάτω", "ποσοτικό", None, "δημοτική"],	
			["καλὰ",     "τροπικό", None, "δημοτική"],	["κακὰ",       "τροπικό", None, "δημοτική"],
			["σιγὰ",     "τροπικό", None, "δημοτική"],	["ἔξαφνα",     "τροπικό", None, "δημοτική"],
			["ἀβέρτα",   "τροπικό", None, "δημοτική"],	["ἀβρὰ",   		"τροπικό", None, "δημοτική"],
			["ξαφνικὰ",  "τροπικό", None, "δημοτική"],	["ἴσια",       "τροπικό", None, "δημοτική"],
			["ὡραία",    "τροπικό", None, "δημοτική"],	["χωριστὰ",    "τροπικό", None, "δημοτική"],
			["μόνο",     "τροπικό", None, "δημοτική"],	["μονάχα",     "τροπικό", None, "δημοτική"],
			["μοναχὰ",   "τροπικό", None, "δημοτική"],	["διαρκῶς",    "τροπικό", None, "δημοτική"],
			["μεμιὰς",   "τροπικό", None, "δημοτική"],	["μονομιὰς",   "τροπικό", None, "δημοτική"],
			["ἐπίσης",   "τροπικό", None, "δημοτική"],	["ἐπικεφαλῆς", "τροπικό", None, "δημοτική"],
			["ἰδίως",    "τροπικό", None, "δημοτική"],	["κυρίως",     "τροπικό", None, "δημοτική"],
			["εἰδεμὴ",   "τροπικό", None, "δημοτική"],	
			["ἀκριβῶς",  "τροπικό", None, "δημοτική"],	["τυχὸν",      "τροπικό", None, "δημοτική"],
			["ἐντελῶς",  "τροπικό", None, "δημοτική"],	["καλῶς",      "τροπικό", None, "δημοτική"],
			["εὐτυχῶς",  "τροπικό", None, "δημοτική"],	["ἑξῆς",       "τροπικό", None, "δημοτική"],
			["ἑλληνικὰ", "τροπικό", None, "δημοτική"],	["γαλλικὰ",    "τροπικό", None, "δημοτική"],
			["χωριάτικα","τροπικό",None, "δημοτική"],
			["μόνο",     "ποσοτικό", None, "δημοτική"],	["πολὺ",       "ποσοτικό", None, "δημοτική"],
			["πιὸ",      "ποσοτικό", None, "δημοτική"],	["περισσότερο", "ποσοτικό", None, "δημοτική"],
			["λίγο",     "ποσοτικό", None, "δημοτική"],	["λιγότερο",   "ποσοτικό", None, "δημοτική"],
			["λιγάκι",   "ποσοτικό", None, "δημοτική"],	["κομμάτι",    "ποσοτικό", None, "δημοτική"],
			["αρκετὰ",   "ποσοτικό", None, "δημοτική"],	["σχεδὸν",     "ποσοτικό", None, "δημοτική"],
			["τουλάχιστο","ποσοτικό", None, "δημοτική"],	["τουλάχιστον", "ποσοτικό", None, "δημοτική"],
			["περίπου",    "ποσοτικό", None, "δημοτική"],
			["καθόλου",   "ποσοτικό", None, "δημοτική"],	["διόλου",     "ποσοτικό", None, "δημοτική"],
			["ολότελα",   "ποσοτικό", None, "δημοτική"],	["ολωσδιόλου", "ποσοτικό", None, "δημοτική"],
			["μᾶλλον",    "ποσοτικό", None, "δημοτική"],	["εξίσου",     "ποσοτικό", None, "δημοτική"],
			["μόλις",     "ποσοτικό", None, "δημοτική"],
			["ναὶ",       "βεβαιωτικό", None, "δημοτική"],	["μάλιστα",    "βεβαιωτικό", None, "δημοτική"],
			["βέβαια",    "βεβαιωτικό", None, "δημοτική"],	["βεβαιότητα", "βεβαιωτικό", None, "δημοτική"],
			["ορισμένως", "βεβαιωτικό", None, "δημοτική"],	["αλήθεια",    "βεβαιωτικό", None, "δημοτική"],
			["αληθινὰ",   "βεβαιωτικό", None, "δημοτική"],	["σωστὰ",      "βεβαιωτικό", None, "δημοτική"],
			["ἴσως",      "αρνητικό", None, "δημοτική"],	["τάχα",     "αρνητικό", None, "δημοτική"],
			["δῆθεν",     "αρνητικό", None, "δημοτική"],	["τάχατε",   "αρνητικό", None, "δημοτική"],
			["άραγε",     "αρνητικό", None, "δημοτική"],	["πιθανὸν",  "αρνητικό", None, "δημοτική"],
			["ὄχι",     "διστακτικό", None, "δημοτική"],	["δὲν",        "διστακτικό", None, "δημοτική"],
			["δὲ",      "διστακτικό", None, "δημοτική"],	["μὴ",         "διστακτικό", None, "δημοτική"],
			["μὴν",     "διστακτικό", None, "δημοτική"],	
			]
		δεδομένα_αναγνώρισης_συσχετικά = [
			["ποῦ",       "τοπικό στάση", "ερωτηματικό", "κοινή"],
			["ποὺ",       "τοπικό στάση", "αόριστο",     "κοινή"],
			["ἐνθάδε",    "τοπικό στάση", "δεικτικό",    "κοινή"],
			["ἐνταῦθα",   "τοπικό στάση", "δεικτικό",    "κοινή"],
			["αὐτοῦ",     "τοπικό στάση", "δεικτικό",    "κοινή"],
			["ἐκεῖ",      "τοπικό στάση", "δεικτικό",    "κοινή"],
			["οὗ",        "τοπικό στάση", "αναφορικό",   "κοινή"],
			["ὅπου",      "τοπικό στάση", "αναφορικό",   "κοινή"],
			["ἔνθα",      "τοπικό στάση", "αναφορικό",   "κοινή"],
			["ὅθι",       "τοπικό στάση", "αναφορικό",   "κοινή"],
			["ποῖ",       "τοπικό από",   "ερωτηματικό", "κοινή"],
			["ποὶ",       "τοπικό από",   "αόριστο",     "κοινή"],
			["ἐνθάδε",    "τοπικό από",   "δεικτικό",    "κοινή"],
			["ἐνταῦθα",   "τοπικό από",   "δεικτικό",    "κοινή"],
			["αὐτόσε",    "τοπικό από",   "δεικτικό",    "κοινή"],
			["ἐκεῖσε",    "τοπικό από",   "δεικτικό",    "κοινή"],
			["οἷ",        "τοπικό από",   "αναφορικό",   "κοινή"],
			["ὅποι",      "τοπικό από",   "αναφορικό",   "κοινή"],
			["ἔνθα",      "τοπικό από",   "αναφορικό",   "κοινή"],
			["πόθεν",     "τοπικό προς",  "ερωτηματικό", "κοινή"],
			["ποθὲν",     "τοπικό προς",  "αόριστο",     "κοινή"],
			["ἐνθένδε",   "τοπικό προς",  "δεικτικό",    "κοινή"],
			["ἐντεῦθεν",  "τοπικό προς",  "δεικτικό",    "κοινή"],
			["ἐκεῖθεν",   "τοπικό προς",  "δεικτικό",    "κοινή"],
			["ὅθεν",      "τοπικό προς",  "αναφορικό",   "κοινή"],
			["ὁπόθεν",    "τοπικό προς",  "αναφορικό",   "κοινή"],
			["ἔνθεν",     "τοπικό προς",  "αναφορικό",   "κοινή"],
			["πότε",      "χρονικό",      "ερωτηματικό", "κοινή"],
			["πηνίκα",    "χρονικό",      "ερωτηματικό", "κοινή"],
			["ποτὲ",      "χρονικό",      "αόριστο",     "κοινή"],
			["τότε",      "χρονικό",      "δεικτικό",    "κοινή"],
			["τηνίκα",    "χρονικό",      "δεικτικό",    "κοινή"],
			["τηνικάδε",  "χρονικό",      "δεικτικό",    "κοινή"],
			["τηνικαῦτα", "χρονικό",      "δεικτικό",    "κοινή"],
			["ὅτε",       "χρονικό",      "αναφορικό",   "κοινή"],
			["ὁπότε",     "χρονικό",      "αναφορικό",   "κοινή"],
			["ἡνίκα",     "χρονικό",      "αναφορικό",   "κοινή"],
			["ὁπηνίκα",   "χρονικό",      "αναφορικό",   "κοινή"],
			["πῶς",       "τροπικό",      "ερωτηματικό", "κοινή"],
			["πὼς",       "τροπικό",      "αόριστο",     "κοινή"],
			["οὕτω",      "τροπικό",      "δεικτικό",    "κοινή"],
			["οὕτως",     "τροπικό",      "δεικτικό",    "κοινή"],
			["ὧδε",       "τροπικό",      "δεικτικό",    "κοινή"],
			["ὡς",        "τροπικό",      "αναφορικό",   "κοινή"],
			["ὥσπερ",     "τροπικό",      "αναφορικό",   "κοινή"],
			["ὅπως",      "τροπικό",      "αναφορικό",   "κοινή"],
			["πῇ",    "τοπικό-τροπικό",   "ερωτηματικό", "κοινή"],
			["πῂ",    "τοπικό-τροπικό",   "αόριστο",     "κοινή"],
			["τῇδε",  "τοπικό-τροπικό",   "δεικτικό",    "κοινή"],
			["ταύτῃ", "τοπικό-τροπικό",   "δεικτικό",    "κοινή"],
			["ᾖ",     "τοπικό-τροπικό",   "αναφορικό",   "κοινή"],
			["ὅπῃ",   "τοπικό-τροπικό",   "αναφορικό",   "κοινή"],
			["πόσον",     "ποσοτικό",     "ερωτηματικό", "κοινή"],
			["τόσον",     "ποσοτικό",     "δεικτικό",    "κοινή"],
			["τοσόνδε",   "ποσοτικό",     "δεικτικό",    "κοινή"],
			["τοσοῦτον",  "ποσοτικό",     "δεικτικό",    "κοινή"],
			["ὅπου",      "ποσοτικό",     "αναφορικό",   "κοινή"],
			["ὁπόσον",    "ποσοτικό",     "αναφορικό",   "κοινή"],

			["ποῦ",       "τοπικό",     "ερωτηματικό", "δημοτική"],
			["κᾶπου",     "τοπικό",     "αόριστο",     "δημοτική"],
			["πουθενὰ",   "τοπικό",     "αόριστο",     "δημοτική"],
			["ἀλλοὺ",     "τοπικό",     "αόριστο",     "δημοτική"],
			["ἐδῶ",       "τοπικό",     "δεικτικό",    "δημοτική"],
			["ἐκεῖ",      "τοπικό",     "δεικτικό",    "δημοτική"],
			["αὐτοῦ",     "τοπικό",     "δεικτικό",    "δημοτική"],
			["παντοῦ",    "τοπικό",     "δεικτικό",    "δημοτική"],
			# ["ἐκεῖ ποὺ",  "τοπικό",     "αναφορικό",   "δημοτική"],
			# ["κάπου κάπου","χρονικό",    "αόριστο",    "δημοτική"],
			# ["πότε πότε", "χρονικό",     "αόριστο",    "δημοτική"],
			# ["τότε ποὺ",  "χρονικό",     "αναφορικό",  "δημοτική"],
			["ὄπου",      "τοπικό",     "αναφορικό",   "δημοτική"],
			["ὀπουδήποτε","τοπικό",     "αναφορικό",   "δημοτική"],
			["πότε",      "χρονικό",     "ερωτηματικό","δημοτική"],
			["κάποτε",    "χρονικό",     "αόριστο",    "δημοτική"],
			["ἄλλοτε",    "χρονικό",     "αόριστο",    "δημοτική"],
			["τότε",      "χρονικό",     "δεικτικό",   "δημοτική"],
			["τῶρα",      "χρονικό",     "δεικτικό",   "δημοτική"],
			["ποτὲ",      "χρονικό",     "δεικτικό",   "δημοτική"],
			["ὄποτε",     "χρονικό",     "αναφορικό",  "δημοτική"],
			["ὁποτεδήποτε","χρονικό",    "αναφορικό",  "δημοτική"],
			["πῶς",       "τροπικό",     "ερωτηματικό","δημοτική"],
			["κάπως",     "τροπικό",     "αόριστο",    "δημοτική"],
			["ἀλλιῶς",    "τροπικό",     "αόριστο",    "δημοτική"],
			["αλλιώτικα", "τροπικό",     "αόριστο",    "δημοτική"],
			["ἔτσι",      "τροπικό",     "δεικτικό",   "δημοτική"],
			["μαζὶ",      "τροπικό",     "δεικτικό",   "δημοτική"],
			["ὄπως",      "τροπικό",     "αναφορικό",  "δημοτική"],
			["καθῶς",     "τροπικό",     "αναφορικό",  "δημοτική"],
			["ὦς",        "τροπικό",     "αναφορικό",  "δημοτική"],
			["σὰν",       "τροπικό",     "αναφορικό",  "δημοτική"],
			["πόσο",      "ποσοτικό",    "ερωτηματικό","δημοτική"],
			["κάμποσο",   "ποσοτικό",    "αόριστο",    "δημοτική"],
			["τόσο",      "ποσοτικό",    "δεικτικό",   "δημοτική"],
			["ὅσο",       "ποσοτικό",    "αναφορικό",  "δημοτική"],
			["ὁσοδήποτε", "ποσοτικό",    "αναφορικό",  "δημοτική"],
			]
		μετρητής, αποτυχίες = 0, 0

		for σύνολο in δεδομένα_αναγνώρισης_γενικά+δεδομένα_αναγνώρισης_συσχετικά:
			αποτέλεσμα = self.αναγνώριση(σύνολο[0], σύνολο[-1])
			if not αποτέλεσμα:
				τύπωσε("   ΑΝΑΜΕΝΟΤΑΝ:",σύνολο,"ΑΠΟΤΕΛΕΣΜΑ:",  αποτέλεσμα)
				αποτυχίες += 1
			else:
				for στοιχείο in σύνολο[1:-1]:
					if στοιχείο:
						nfound = False
						for α in αποτέλεσμα:
							if α["μέρος του λόγου"]=="επίρρημα" and\
								στοιχείο in α["Μεταδεδομένα"]['ιδιότητες']:
								nfound = True
						if not nfound:
							τύπωσε("   ΑΝΑΜΕΝΟΤΑΝ:",σύνολο,"ΑΠΟΤΕΛΕΣΜΑ:",  αποτέλεσμα)
							αποτυχίες += 1
			μετρητής += 1
		τύπωσε("Δοκιμές αναγνώρισης Επιρρημάτων", μετρητής," Αποτυχίες:",αποτυχίες)

if __name__=="__main__":
	δε = Δοκιμές_Επιρρημάτων()
	τύπωσε("Δοκιμές αναγνώρισης")
	δε.δοκιμές_αναγνώρισης()