#!/usr/bin/python3
# -*- coding: utf-8 -*-
#
# Copyright (c) 2011, dimitriadis dimitris
# All rights reserved.
#
# Redistribution and use in source and binary forms, with or without
# modification, are permitted provided that the following conditions are met:
#    * Redistributions of source code must retain the above copyright
#      notice, this list of conditions and the following disclaimer.
#    * Redistributions in binary form must reproduce the above copyright
#      notice, this list of conditions and the following disclaimer in the
#      documentation and/or other materials provided with the distribution.
#    * Neither the name of the dimitriadis dimitris nor the
#      names of its contributors may be used to endorse or promote products
#      derived from this software without specific prior written permission.
#
# THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
# ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
# WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
# DISCLAIMED. IN NO EVENT SHALL dimitriadis dimitris BE LIABLE FOR ANY
# DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
# (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
# LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
# ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
# (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
# SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
	
import os, sys, json

τύπωσε = print
κείμενο = str
class Δοκιμές_Επιθέτων():
	def __init__(self, γραμματική, δεδομένα):
		self.επίθετα = γραμματική.επίθετα
		self.αναγνώριση = γραμματική.αναγνώριση
		self.δεδομένα = δεδομένα.κ["επίθετο"]
		self.τ = γραμματική.τ
		self._μεταβλητές()
		self._αναγνωρίσεις()
		
	def _μεταβλητές(self):
		self.αριθμό_σε_πτώση  = { 0:"ονομαστική",   1:"γενική",   2:"δοτική",   3:"αιτιατική",   4:"κλητική"   }
		self.αριθμό_σε_αριθμό = { 0:"ενικός",   1:"δυϊκός",   2:"πληθυντικός"    }
		self.λεξικό_αναγνώρισης = {}
		
	def _αναγνωρίσεις(self):
		self.λεξικό_αναγνώρισης.clear()
		for διάλεκτος, λήμματα in self.δεδομένα.items():
			if not λήμματα:
				continue
			self.λεξικό_αναγνώρισης[διάλεκτος] = {}
			rtemp = {}
			for λήμμα, γένη in λήμματα.items():
				for γένος in γένη:
					for ααριθμός in [0,1,2]:
						ttmp = {}
						αριθμός = self.αριθμό_σε_αριθμό[ααριθμός]
						for απτώση in range(5):
							πτώση = self.αριθμό_σε_πτώση[απτώση]
							καταλήξεις = γένη[γένος][ααριθμός*5+απτώση]
							for υποκατάληξη in καταλήξεις:
								if not υποκατάληξη in ttmp:
									κλέξη = self.τ.κωδικοποιητής(υποκατάληξη)
									self.τ.αφαίρεσε_τόνους(κλέξη)
									αλέξη = self.τ.απο(κλέξη, True)
									υποσύνολο = {
										"διάλεκτος":διάλεκτος,
										"αριθμός":self.αριθμό_σε_αριθμό[ααριθμός],
										"πτώση":[πτώση],
										"γένος":γένος}
									ttmp[υποκατάληξη] = υποσύνολο
								else:
									ttmp[υποκατάληξη]["πτώση"].append(πτώση)
									ttmp[υποκατάληξη]["πτώση"].sort()
						for k,v in ttmp.items():
							if not k in rtemp:
								rtemp[k] = [v]
							else:
								rtemp[k].append(v)
			self.λεξικό_αναγνώρισης[διάλεκτος] = rtemp
								
	def δοκιμές_αναγνώρισης(self):
		# Έλεγχος: διαλέκτου, αριθμού, πτώσης, γένους, λήμματος+κατάληξης, 
		μετρητής, αποτυχίες = 0, 0
		
		for διάλεκτος, λέξεις in self.λεξικό_αναγνώρισης.items():
			for λέξη, δεδομένα in λέξεις.items():
				
				αποτελέσματα = self.αναγνώριση(λέξη, διάλεκτος)
				αστοχίες_list = []
				
				for δεδομένο in δεδομένα:
					αστοχίες_list = [] 
					for αποτέλεσμα in αποτελέσματα:
						if διάλεκτος!=αποτέλεσμα["διάλεκτος"]:
							continue
						αστοχίες = self.__σύγκριση_λεξικών(δεδομένο, αποτέλεσμα, λέξη)
						if not αστοχίες:
							αστοχίες_list = []
							break
						else:
							αστοχίες_list.append(αστοχίες)
					
				if αστοχίες_list:
					print(λέξη, διάλεκτος)
					for αστοχία in αστοχίες_list:
						for k,v in αστοχία.items():
							print(k,"   ΑΝΑΜΕΝΟΤΑΝ:",v[0],"ΑΠΟΤΕΛΕΣΜΑ:",  v[1])
						print()
					αποτυχίες += 1
				μετρητής += 1
						
		print("Δοκιμές αναγνώρισης Επιθέτων", "Δοκιμές:", μετρητής," Αποτυχίες:",αποτυχίες)
		return αποτυχίες

	def __σύγκριση_λεξικών(self, λεξικό, αποτέλεσμα, λέξη):
		αστοχίες = {}

		for k,v in λεξικό.items():
			if not k in αποτέλεσμα:
				αστοχίες[k] = [v, 'Τίποτα']
			else:
				if v!=αποτέλεσμα[k]:
					αστοχίες[k] = [v, αποτέλεσμα[k]]

		return αστοχίες
	
	def δοκιμές_κλίσης(self):
		δοκιμασμένα = 0
		αποτυχίες = 0
		for διάλεκτος, λέξεις in self.δεδομένα.items():
			λέξεις = list(λέξεις.keys())
			λέξεις.sort()
			for λέξη in λέξεις:
				for γένος in ['αρσενικό','θηλυκό','ουδέτερο']:
					δείκτης_αριθμού = 0
					for αριθμός in ['ενικός','δυϊκός','πληθυντικός']:
						δείκτης_πτώσης = 0
						for πτώση in ['ονομαστική','γενική','δοτική','αιτιατική','κλητική']:
							αποτελέσματα = self.επίθετα.κλίνε(λέξη, αριθμός, πτώση, γένος, διάλεκτος=διάλεκτος)
							αναμενόμενο =  self.δεδομένα[διάλεκτος][λέξη][γένος][δείκτης_αριθμού*5+δείκτης_πτώσης]
							if αποτελέσματα:
								OK = False
								for a in αναμενόμενο:
									if a not in αποτελέσματα:
										OK = True
										break

								if OK:
									print( λέξη, διάλεκτος, γένος, αριθμός, πτώση)
									print( "ΑΠΟΤΕΛΕΣΜΑ:", αποτελέσματα, "   ΑΝΑΜΕΝΟΤΑΝ:", αναμενόμενο)
									αποτυχίες += 1
								δοκιμασμένα += 1
							elif αναμενόμενο:
								print(λέξη, αποτελέσματα,"!=",αναμενόμενο, αριθμός, πτώση, γένος, διάλεκτος)
								αποτυχίες += 1
								δοκιμασμένα += 1
							δείκτης_πτώσης += 1
						δείκτης_αριθμού += 1
		print("Δοκιμές κλίσης Επιθέτων", "Δοκιμές:",δοκιμασμένα," Αποτυχίες:", αποτυχίες)
		return αποτυχίες

if __name__ == "__main__":
	e = Δοκιμές_Επιθέτων()
	#e.δοκιμές_κλίσης()
	#e.δοκιμές_αναγνώρισης()
	#e._επαλήθευση_λεξικού()

unity_δοκιμές = [
	["*μεγάλος",["αρσενικό","ενικός","ονομαστική"]],
		["*μεγάλη",["θηλικό","ενικός","ονομαστική"]],
		["*μεγάλο",["ουδέτερο","ενικός","ονομαστική"]],
		["*βαθὺς",["αρσενικό","ενικός","ονομαστική"]],
		["*βαθιὰ",["θηλικό","ενικός","ονομαστική"]],
		["*βαθὺ",["ουδέτερο","ενικός","ονομαστική"]],

		["*θαλασσὴς",["αρσενικό","ενικός","ονομαστική"]],
		["*θαλασσιὰ",["θηλικό","ενικός","ονομαστική"]],
		["*θαλασσὶ",["ουδέτερο","ενικός","ονομαστική"]],

		["*ἔτοιμος",["αρσενικό","ενικός","ονομαστική"]],
		["*ἔτοιμη",["θηλικό","ενικός","ονομαστική"]],
		["*ἔτοιμο",["ουδέτερο","ενικός","ονομαστική"]],
		["*ἔτοιμου",["αρσενικό","ενικός","γενική"]],
		["*ἔτοιμης",["θηλικό","ενικός","γενική"]],
		["*ἔτοιμου",["ουδέτερο","ενικός","γενική"]],
		["*ἔτοιμων",["αρσενικό","πληθυντικός","γενική"]],
		["*ἔτοιμων",["θηλικό","πληθυντικός","γενική"]],
		["*ἔτοιμων",["ουδέτερο","πληθυντικός","γενική"]],
		["*ἔτοιμους",["αρσενικό","πληθυντικός","αιτιατική"]],

		["*κυριακάτικος",["αρσενικό","ενικός","ονομαστική"]],
		["*κυριακάτικου",["αρσενικό","ενικός","γενική"]],
		["*κυριακάτικου",["ουδέτερο","ενικός","γενική"]],
		["*κυριακάτικων",["αρσενικό","πληθυντικός","γενική"]],
		["*κυριακάτικων",["θηλικό","πληθυντικός","γενική"]],
		["*κυριακάτικων",["ουδέτερο","πληθυντικός","γενική"]],
		["*κυριακάτικους",["αρσενικό","πληθυντικός","αιτιατική"]],

		["*ἀνοιχτομάτης",["αρσενικό","ενικός","ονομαστική"]],
		["*ἀνοιχτομάτη",["αρσενικό","ενικός","γενική"]],
		["*ἀνοιχτομάτη",["αρσενικό","ενικός","αιτιατική"]],
		["*ἀνοιχτομάτη",["αρσενικό","ενικός","κλητική"]],
		["*ἀνοιχτομάτηδες",["αρσενικό","πληθυντικός","ονομαστική"]],
		["*ἀνοιχτομάτηδες",["αρσενικό","πληθυντικός","αιτιατική"]],
		["*ἀνοιχτομάτηδες",["αρσενικό","πληθυντικός","κλητική"]],
		["*ἀνοιχτομᾶτα",["θηλικό","ενικός","ονομαστική"]],
		["*ἀνοιχτομᾶτα",["θηλικό","ενικός","αιτιατική"]],
		["*ἀνοιχτομᾶτα",["θηλικό","ενικός","κλητική"]],
		["*ἀκριβὸς",["αρσενικό","ενικός","ονομαστική"]],
		["*δυνατὸς",["αρσενικό","ενικός","ονομαστική"]],
		["*σκοτεινὸς",["αρσενικό","ενικός","ονομαστική"]],
		["*ταπεινὸς",["αρσενικό","ενικός","ονομαστική"]],
		["*τυχερὸς",["αρσενικό","ενικός","ονομαστική"]],
		["*βραδινὸς",["αρσενικό","ενικός","ονομαστική"]],
		["*σφιχτὸς",["αρσενικό","ενικός","ονομαστική"]],

		["*μαῦρος",["αρσενικό","ενικός","ονομαστική"]],
		["*δροσάτος",["αρσενικό","ενικός","ονομαστική"]],

		["*ἔτοιμος",["αρσενικό","ενικός","ονομαστική"]],
		["*ἥσυχος",["αρσενικό","ενικός","ονομαστική"]],
		["*ξύλινος",["αρσενικό","ενικός","ονομαστική"]],
		["*πράσινος",["αρσενικό","ενικός","ονομαστική"]],
		["*ἀκούραστος",["αρσενικό","ενικός","ονομαστική"]],

		["*ἀραιὸς",["αρσενικό","ενικός","ονομαστική"]],
		["*στερεὸς",["αρσενικό","ενικός","ονομαστική"]],
		["*ἀκέραιος",["αρσενικό","ενικός","ονομαστική"]],
		["*βέβαιος",["αρσενικό","ενικός","ονομαστική"]],
		["*δίκαιος",["αρσενικό","ενικός","ονομαστική"]],
		["*μάταιος",["αρσενικό","ενικός","ονομαστική"]],
		["*ὄγδοος",["αρσενικό","ενικός","ονομαστική"]],
		["*παμπάλαιος",["αρσενικό","ενικός","ονομαστική"]],
		["*ὑπάκουος",["αρσενικό","ενικός","ονομαστική"]],
		["*στέρεος",["αρσενικό","ενικός","ονομαστική"]],

		["*ἀθῶος",["αρσενικό","ενικός","ονομαστική"]],
		["*ἀρχαῖος",["αρσενικό","ενικός","ονομαστική"]],
		["*ἀστεῖος",["αρσενικό","ενικός","ονομαστική"]],
		["*κρύος",["αρσενικό","ενικός","ονομαστική"]],
		["*νέος",["αρσενικό","ενικός","ονομαστική"]],
		["*τελευταῖος",["αρσενικό","ενικός","ονομαστική"]],
		["*γκρίζος",["αρσενικό","ενικός","ονομαστική"]],
		["*πανοῦργος",["αρσενικό","ενικός","ονομαστική"]],
		["*σβέλτος",["αρσενικό","ενικός","ονομαστική"]],
		["*σβέλτα",["θηλικό","ενικός","ονομαστική"]],
		#["*σβέλτη",["αρσενικό","ενικός","ονομαστική"]],
		["*σκοῦρος",["αρσενικό","ενικός","ονομαστική"]],
		["*στεῖρος",["αρσενικό","ενικός","ονομαστική"]],
	["*ἄγριος",["αρσενικό","ενικός","ονομαστική"]],
		["*ἀδέξιος",["αρσενικό","ενικός","ονομαστική"]],
		["*αἰώνιος",["αρσενικό","ενικός","ονομαστική"]],
		["*δόλιος",["αρσενικό","ενικός","ονομαστική"]],
		["*ἴσιος",["αρσενικό","ενικός","ονομαστική"]],
		["*καινούριος",["αρσενικό","ενικός","ονομαστική"]],
		["*κούφιος",["αρσενικό","ενικός","ονομαστική"]],
		["*μέτριος",["αρσενικό","ενικός","ονομαστική"]],
		["*ὄρθιος",["αρσενικό","ενικός","ονομαστική"]],
		["*οὑράνιος",["αρσενικό","ενικός","ονομαστική"]],
		["*περίσσιος",["αρσενικό","ενικός","ονομαστική"]],
		["*σπάνιος",["αρσενικό","ενικός","ονομαστική"]],
		["*τεράστιος",["αρσενικό","ενικός","ονομαστική"]],
		["*τίμιος",["αρσενικό","ενικός","ονομαστική"]],
		["*παλιὸς",["αρσενικό","ενικός","ονομαστική"]],
		["*ἄδειος",["αρσενικό","ενικός","ονομαστική"]],
		["*ἐπιτήδειος",["αρσενικό","ενικός","ονομαστική"]],
		["*κυκλώπειος",["αρσενικό","ενικός","ονομαστική"]],
		["*τέλειος",["αρσενικό","ενικός","ονομαστική"]],
		["*ὅμοιος",["αρσενικό","ενικός","ονομαστική"]],
		["*ἀνόμοιος",["αρσενικό","ενικός","ονομαστική"]],
		["*παρόμοιος",["αρσενικό","ενικός","ονομαστική"]],
		["*ἁλληλέγγυος",["αρσενικό","ενικός","ονομαστική"]],

		["*ἀσημένιος",["αρσενικό","ενικός","ονομαστική"]],
		["*βελουδένιος",["αρσενικό","ενικός","ονομαστική"]],
		["*μαρμαρένιος",["αρσενικό","ενικός","ονομαστική"]],
		["*σιδερένιος",["αρσενικό","ενικός","ονομαστική"]],
		["*ἀρνίσιος",["αρσενικό","ενικός","ονομαστική"]],
		["*βουνίσιος",["αρσενικό","ενικός","ονομαστική"]],

		["*ἄρρωστος",["αρσενικό","ενικός","ονομαστική"]],
		["*κύριος",["αρσενικό","ενικός","ονομαστική"]],
		["*βάρβαροι",["αρσενικό","πληθυντικός","ονομαστική"]],
		["*ἄρρωστου",["αρσενικό","ενικός","γενική"]],
		["*ἄρρωστους",["αρσενικό","πληθυντικός","αιτιατική"]],
		["*συνήθειες",["θηλικό","πληθυντικός","ονομαστική"]],
		["*βάρβαρων",["αρσενικό","πληθυντικός","γενική"]],
		#["*αρρώστου",["αρσενικό","ενικός","γενική"]],
		#["*αρρώστους",["αρσενικό","πληθυντικός","γενική"]],
		#["*βαρβάρων",["αρσενικό","πληθυντικός","γενική"]],
		["*γνωστικὸς",["αρσενικό","ενικός","ονομαστική"]],
		["*θηλυκὸς",["αρσενικό","ενικός","ονομαστική"]],
		["*κακὸς",["αρσενικό","ενικός","ονομαστική"]],
		["*κρητικὸς",["αρσενικό","ενικός","ονομαστική"]],
		["*μαλακὸς",["αρσενικό","ενικός","ονομαστική"]],
		["*νηστικὸς",["αρσενικό","ενικός","ονομαστική"]],
		["*φτωχὸς",["αρσενικό","ενικός","ονομαστική"]],
		["*ζακυνθινὸς",["αρσενικό","ενικός","ονομαστική"]],
		["*φρέσκος",["αρσενικό","ενικός","ονομαστική"]],
		["*κακιὰ",["θηλικό","ενικός","ονομαστική"]],
		["*κακὴ",["θηλικό","ενικός","ονομαστική"]],
		["*φτωχιὰ",["θηλικό","ενικός","ονομαστική"]],
		["*φτωχὴ",["θηλικό","ενικός","ονομαστική"]],
		["*ξανθὸς",["αρσενικό","ενικός","ονομαστική"]],
		["*ξανθιὰ",["θηλικό","ενικός","ονομαστική"]],
		["*ξανθὴ",["θηλικό","ενικός","ονομαστική"]],
		["*φτωχὲς",["θηλικό","πληθυντικός","ονομαστική"]],
		["*εὐγενικὲς",["θηλικό","πληθυντικός","ονομαστική"]],

		["*ἁδρὺς",["αρσενικό","ενικός","ονομαστική"]],
		["*ἀψὺς",["αρσενικό","ενικός","ονομαστική"]],
		["*βαρὺς",["αρσενικό","ενικός","ονομαστική"]],
		["*δασὺς",["αρσενικό","ενικός","ονομαστική"]],
		["*ἑλαφρὺς",["αρσενικό","ενικός","ονομαστική"]],
		["*μακρὺς",["αρσενικό","ενικός","ονομαστική"]],
		["*παχὺς",["αρσενικό","ενικός","ονομαστική"]],
		["*πλατὺς",["αρσενικό","ενικός","ονομαστική"]],
		["*τραχὺς",["αρσενικό","ενικός","ονομαστική"]],
		["*φαρδὺς",["αρσενικό","ενικός","ονομαστική"]],

		["*βυσσινὴς",["αρσενικό","ενικός","ονομαστική"]],
		["*θαλασσὴς",["αρσενικό","ενικός","ονομαστική"]],
		["*κανελὴς",["αρσενικό","ενικός","ονομαστική"]],
		["*καφετὴς",["αρσενικό","ενικός","ονομαστική"]],
		["*μαβὴς",["αρσενικό","ενικός","ονομαστική"]],
		["*μενεξεδὴς",["αρσενικό","ενικός","ονομαστική"]],
		["*οὐρανὴς",["αρσενικό","ενικός","ονομαστική"]],
		["*χρυσαφὴς",["αρσενικό","ενικός","ονομαστική"]],
		#["*αδρὸς",["αρσενικό","ενικός","ονομαστική"]],
		#["*αδρὸ",["αρσενικό","ενικός","ονομαστική"]],
		["*λαφρὺς",["αρσενικό","ενικός","ονομαστική"]],
		#["*ελαφρὸς",["αρσενικό","ενικός","ονομαστική"]],
		#["*ελαφρὸ",["αρσενικό","ενικός","ονομαστική"]],

		["*ἀκαμάτης",["αρσενικό","ενικός","ονομαστική"]],
		["*κατσούφης",["αρσενικό","ενικός","ονομαστική"]],
		["*πεισματάρης",["αρσενικό","ενικός","ονομαστική"]],
		["*ἀρρωστιάρης",["αρσενικό","ενικός","ονομαστική"]],
		["*γκρινιάρης",["αρσενικό","ενικός","ονομαστική"]],
		["*ζημιάρης",["αρσενικό","ενικός","ονομαστική"]],
		["*κιτρινιάρης",["αρσενικό","ενικός","ονομαστική"]],
		["*μεροκαματιάρης",["αρσενικό","ενικός","ονομαστική"]],
		["*φοβητσιάρης",["αρσενικό","ενικός","ονομαστική"]],
		["*μακρολαίμης",["αρσενικό","ενικός","ονομαστική"]],
		["*σγουρομάλλης",["αρσενικό","ενικός","ονομαστική"]],
		["*ἀνοιχτομάτης",["αρσενικό","ενικός","ονομαστική"]],
		["*ψηλομύτης",["αρσενικό","ενικός","ονομαστική"]],
		["*στραβοπόδης",["αρσενικό","ενικός","ονομαστική"]],
		["*καμαροφρύδης",["αρσενικό","ενικός","ονομαστική"]],
		["*ἁπλοχέρης",["αρσενικό","ενικός","ονομαστική"]],
		["*μικρούλης",["αρσενικό","ενικός","ονομαστική"]],
		["*μικροῦλι",["ουδέτερο","ενικός","ονομαστική"]],
		["*φτωχούλης",["αρσενικό","ενικός","ονομαστική"]],
		["*φτωχοῦλι",["ουδέτερο","ενικός","ονομαστική"]],
		["*ξανθομάλλης",["αρσενικό","ενικός","ονομαστική"]],
		["*ξανθομάλλα",["θηλικό","ενικός","ονομαστική"]],
		["*ξανθομαλλοῦσα",["θηλικό","ενικός","ονομαστική"]],
		["*ξανθομαλλοὺ",["θηλικό","ενικός","ονομαστική"]],
		["*μαυρομάτης",["αρσενικό","ενικός","ονομαστική"]],
		["*μαυρομᾶτα",["θηλικό","ενικός","ονομαστική"]],
		["*μαυροματοῦσα",["θηλικό","ενικός","ονομαστική"]],
		["*μαυροματοὺ",["θηλικό","ενικός","ονομαστική"]],
		["*ὑπναρὰς",["αρσενικό","ενικός","ονομαστική"]],
		["*ὑπναροὺ",["θηλικό","ενικός","ονομαστική"]],
		["*ὑπναράδικο",["ουδέτερο","ενικός","ονομαστική"]],
		["*λογὰς",["αρσενικό","ενικός","ονομαστική"]],
		["*φαγὰς",["αρσενικό","ενικός","ονομαστική"]],

	["*ἐπιεικὴς",["αρσενικό","ενικός","ονομαστική"]],
		["*ἀκριβὴς",["αρσενικό","ενικός","ονομαστική"]],
		["*διεθνὴς",["αρσενικό","ενικός","ονομαστική"]],
		["*ἑλώδης",["αρσενικό","ενικός","ονομαστική"]],
		["*ἑλώδων",["αρσενικό","πληθυντικός","γενική"]],
		["*συγγενὴς",["αρσενικό","ενικός","ονομαστική"]],
		["*συγγενῆ",["αρσενικό","ενικός","γενική"]],
		["*εὐγενὴς",["αρσενικό","ενικός","ονομαστική"]],
		["*εὐγενῆ",["αρσενικό","ενικός","γενική"]],
	]