#!/usr/bin/python3
# -*- coding: utf-8 -*-
#
# Copyright (c) 2011, dimitriadis dimitris
# All rights reserved.
#
# Redistribution and use in source and binary forms, with or without
# modification, are permitted provided that the following conditions are met:
#    * Redistributions of source code must retain the above copyright
#      notice, this list of conditions and the following disclaimer.
#    * Redistributions in binary form must reproduce the above copyright
#      notice, this list of conditions and the following disclaimer in the
#      documentation and/or other materials provided with the distribution.
#    * Neither the name of the dimitriadis dimitris nor the
#      names of its contributors may be used to endorse or promote products
#      derived from this software without specific prior written permission.
#
# THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
# ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
# WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
# DISCLAIMED. IN NO EVENT SHALL dimitriadis dimitris BE LIABLE FOR ANY
# DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
# (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
# LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
# ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
# (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
# SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

τύπωσε = print
κείμενο = str
λίστα = list
μήκος = len
εύρος = range
ακέραιος = int
τίποτα = None
ναι = True
όχι = False

class Δοκιμές_Συνδέσμων():
	def __init__(self, γραμματική):
		self.αναγνώριση = γραμματική.αναγνώριση

	def δοκιμές_αναγνώρισης(self):
		δεδομένα_αναγνώρισης = [
			["τε",    "κοινή",   'συμπλεκτικοί καταφατικοί'],
			["οὔτε",  "κοινή",   "συμπλεκτικοί αποφατικοί"],
			["μήτε",  "κοινή",   "συμπλεκτικοί αποφατικοί"],
			["οὐδε",  "κοινή",   "συμπλεκτικοί αποφατικοί"],
			["μηδέ",  "κοινή",   "συμπλεκτικοί αποφατικοί"],
			["ἤ",     "κοινή",   "διαζευκτικοί"],	["ἤτοι",  "κοινή",   "διαζευκτικοί"],
			["εἴτε",  "κοινή",   "διαζευκτικοί"],	["ἐάντε", "κοινή",   "διαζευκτικοί"],
			["ἄντε",  "κοινή",   "διαζευκτικοί"],	["ἤντε",  "κοινή",   "διαζευκτικοί"],
			["μέν",         "κοινή", "αντιθετικοί"],	["δέ",          "κοινή", "αντιθετικοί"],
			["μέντοι",      "κοινή", "αντιθετικοί"],	["ὅμως",        "κοινή", "αντιθετικοί"],
			["ἀλλά",        "κοινή", "αντιθετικοί"],	["ἀτὰρ",        "κοινή", "αντιθετικοί"],
			["μὴν",         "κοινή", "αντιθετικοί"],	
			
			["καίτοι",      "κοινή", "αντιθετικοί"],
			# ["οὐ μὴν ἀλλὰ", "κοινή", "αντιθετικοί"],
			# ["καὶ μὴν",     "κοινή", "αντιθετικοί"],	
			# ["ἀλλὰ μὴν",    "κοινή", "αντιθετικοί"],
			# ["εἰ καί",      "κοινή", "ενδοτικοί"], ["ἄν καὶ",      "κοινή", "ενδοτικοί"],
			# ["καὶ εἰ",      "κοινή", "ενδοτικοί"], ["καί ἄν",      "κοινή", "ενδοτικοί"],
			# ["οὐδ' εἰ",     "κοινή", "ενδοτικοί"],
			# ["οὐδ' ἐάν",    "κοινή", "ενδοτικοί"], ["μηδ' ἐαν",    "κοινή", "ενδοτικοί"],
			# ["νοεῖς τούτο", "κοινή", "ενδοτικοί"],
			# ["ἄν καί",  "δημοτική",   "αντιθετικοί"],	
			# ["ὤστε νά", "δημοτική",   "αποτελεσματικοί"],
			# ["γιά νά",  "δημοτική",   "τελικοί"],
			# ["ὄσο που", "δημοτική",   "χρονικοί"],
			# ["πρίν νά", "δημοτική",   "χρονικοί"],	
			["κἄν",         "κοινή", "ενδοτικοί"], ["καίπερ",      "κοινή", "ενδοτικοί"], 
			["ὡς",       "κοινή", "χρονικοί"],	["ὅτε",      "κοινή", "χρονικοί"],
			["ὁπότε",    "κοινή", "χρονικοί"],	["ὁσάκις",   "κοινή", "χρονικοί"],
			["ὁποσάκις", "κοινή", "χρονικοί"],	["ἡνίκα",    "κοινή", "χρονικοί"],
			["ὁπηνίκα",  "κοινή", "χρονικοί"],	["ἐπεί",     "κοινή", "χρονικοί"],
			["ἐπειδὴ",   "κοινή", "χρονικοί"],	["ὅταν",     "κοινή", "χρονικοί"],
			["ὁπόταν",   "κοινή", "χρονικοί"],	["ἐπάν",     "κοινή", "χρονικοί"],
			["ἐπειδὰν",  "κοινή", "χρονικοί"], ["ἕως",      "κοινή", "χρονικοί"],
			["ἔστε",     "κοινή", "χρονικοί"],	["ἄχρι",     "κοινή", "χρονικοί"],
			["μέχρι",    "κοινή", "χρονικοί"],	["πρίν",     "κοινή", "χρονικοί"],
			["γὰρ",    "κοινή", "αιτιολογικοί"],	["ὅτι",    "κοινή", "αιτιολογικοί"],
			["ὡς",     "κοινή", "αιτιολογικοί"],	["διότι",  "κοινή", "αιτιολογικοί"],
			["ἐπεί",   "κοινή", "αιτιολογικοί"],	["ἐπειδή", "κοινή", "αιτιολογικοί"],
			["ἵνα",  "κοινή", "τελικοί"], ["ὅπως", "κοινή", "τελικοί"],
			["ὡς",   "κοινή", "τελικοί"],
			["ἄρα",       "κοινή", "συμπερασματικοί"],	["δή",        "κοινή", "συμπερασματικοί"],
			["δῆτα",      "κοινή", "συμπερασματικοί"],	["οὖν",       "κοινή", "συμπερασματικοί"],
			["τοίνυν",    "κοινή", "συμπερασματικοί"],	["τοιγάρτοι", "κοινή", "συμπερασματικοί"],
			["τοιγαροῦν", "κοινή", "συμπερασματικοί"],	["οὔκουν",    "κοινή", "συμπερασματικοί"],
			["οὐκοῦν",    "κοινή", "συμπερασματικοί"],	["ὥστε",      "κοινή", "συμπερασματικοί"],
			["ὡς",        "κοινή", "συμπερασματικοί"],
			["ὅτι",       "κοινή", "ειδικοί"],	["ὡς",        "κοινή", "ειδικοί"],
			["εἰ",        "κοινή", "υποθετικοί"],	["ἐάν",       "κοινή", "υποθετικοί"],
			["ἄν",        "κοινή", "υποθετικοί"],	["ἤν",        "κοινή", "υποθετικοί"],
			["μή",        "κοινή", "ενδιαστικοί"], ["μὴ",        "κοινή", "ενδιαστικοί"],
			["οὐ",        "κοινή", "ενδιαστικοί"],
			["καί",     "δημοτική",   "συμπλεκτικοί"], ["κὶ",      "δημοτική",   "συμπλεκτικοί"],
			["οὔτε",    "δημοτική",   "συμπλεκτικοί"], ["μήτε",    "δημοτική",   "συμπλεκτικοί"],
			["οὐδέ",    "δημοτική",   "συμπλεκτικοί"], ["μηδέ",    "δημοτική",   "συμπλεκτικοί"],
			["ἤ",       "δημοτική",   "διαζευκτικοί"], ["εἴτε",   "δημοτική",   "διαζευκτικοί"],
			["μα",      "δημοτική",   "αντιθετικοί"],	["ἀλλά",    "δημοτική",   "αντιθετικοί"],
			["παρά",    "δημοτική",   "αντιθετικοί"],	["ὅμως",    "δημοτική",   "αντιθετικοί"],
			["ὠστόσο",  "δημοτική",   "αντιθετικοί"],	["ἐνώ",     "δημοτική",   "αντιθετικοί"],
			["μολονότι","δημοτική",   "αντιθετικοί"],
			["μόνο",    "δημοτική",   "αντιθετικοί"],
			["δηλαδή",  "δημοτική",   "επεξηγηματικοί"],
			["παρά",    "δημοτική",   "συγκριτικοί"],
			["ὅταν",    "δημοτική",   "χρονικοί"],	["σάν",     "δημοτική",   "χρονικοί"],
			["ἐνῶ",     "δημοτική",   "χρονικοί"],	["καθὼς",   "δημοτική",   "χρονικοί"],
			["ἀφοῦ",    "δημοτική",   "χρονικοί"],	["ἀφότου",  "δημοτική",   "χρονικοί"],
			["πρίν",    "δημοτική",   "χρονικοί"],	
			["μόλις",   "δημοτική",   "χρονικοί"],	["προτοῦ",  "δημοτική",   "χρονικοί"],
			["ὤσπου",   "δημοτική",   "χρονικοί"],	["ὠσότου",  "δημοτική",   "χρονικοί"],
			["ὄποτε",   "δημοτική",   "χρονικοί"],
			["γιατί",   "δημοτική",   "αιτιολογικοί"], ["επειδή",  "δημοτική",   "αιτιολογικοί"],
			["ἀφοῦ",    "δημοτική",   "αιτιολογικοί"], ["τι",      "δημοτική",   "αιτιολογικοί"],
			["νά",      "δημοτική",   "τελικοί"],      
			["λοιπόν",  "δημοτική",   "συμπερασματικοί"],	["ὤστε",     "δημοτική",   "συμπερασματικοί"],
			["ἄρα",     "δημοτική",   "συμπερασματικοί"],	["ἐπομένως", "δημοτική",   "συμπερασματικοί"],
			["που",     "δημοτική",   "συμπερασματικοί"],
			["πως",    "δημοτική",   "ειδικοί"], ["που",    "δημοτική",   "ειδικοί"],
			["ὄτι",    "δημοτική",   "ειδικοί"],
			["ἀν",     "δημοτική",   "υποθετικοί"], ["σάν",    "δημοτική",   "υποθετικοί"],
			["ἄμα",    "δημοτική",   "υποθετικοί"],
			["μη",     "δημοτική",   "ενδιαστικοί"], ["μην",    "δημοτική",   "ενδιαστικοί"],
			["μήπως",  "δημοτική",   "ενδιαστικοί"],
			["ὤστε",    "δημοτική",   "αποτελεσματικοί"],
			["που",     "δημοτική",   "αποτελεσματικοί"],
			]
		μετρητής, αποτυχίες = 0, 0

		for σύνολο in δεδομένα_αναγνώρισης:
			αποτέλεσμα = self.αναγνώριση(σύνολο[0], σύνολο[1])
			if not αποτέλεσμα:
				τύπωσε("   ΑΝΑΜΕΝΟΤΑΝ:",σύνολο,"ΑΠΟΤΕΛΕΣΜΑ:",  αποτέλεσμα)
				αποτυχίες += 1
			else:
				nfound = False
				for α in αποτέλεσμα:
					if α["μέρος του λόγου"]=="σύνδεσμος" and\
						σύνολο[2] in α["Μεταδεδομένα"]['ιδιότητες']:
						nfound = True
						break
				if not nfound:
					τύπωσε("   ΑΝΑΜΕΝΟΤΑΝ:",σύνολο,"ΑΠΟΤΕΛΕΣΜΑ:",  αποτέλεσμα)
					αποτυχίες += 1
			μετρητής += 1
		τύπωσε("Δοκιμές αναγνώρισης Συνδέσμων", "Δοκιμές:", μετρητής," Αποτυχίες:",αποτυχίες)

if __name__=="__main__":
	δσ = Δοκιμές_Συνδέσμων()
	δσ.δοκιμές_αναγνώρισης()